WorkSheet/app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'park' LIMIT 1
UPDATE "users" SET "admin" = 't' WHERE "users"."id" = 1
---
  def log_in
    unless request.get?
      name = params[:user][:username]
      keys = params[:user][:password]
      @user = User.find_by_username(name)
      if @user.class == NilClass
        redirect_to :controller => 'home', :action => 'log_in'
      elsif @user.password == keys
        @user.admin = true
        @user.save