WorkSheet/app/controllers/sheets_controller.rb

SELECT "sheets".* FROM "sheets"
---
  def index
    @sheets = Sheet.all

SELECT "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @sheet = Sheet.find(params[:id])

SELECT "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @sheet = Sheet.find(params[:id])

INSERT INTO "sheets" ("created_at", "discussions", "final", "labs", "project", "student_name", "student_number", "test", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sheet = Sheet.new(params[:sheet])
    temp1 = Talk.last
    temp2 = Experiment.last
    temp3 = Sheet.last
    if temp3.id == (temp2.sheet_id+1)
      @sheet.labs = temp2.lab1+temp2.lab2+temp2.lab3+temp2.lab4+temp2.lab5+temp2.lab6+temp2.lab7
    else
      redirect_to :controller => 'sheets', :action => 'new'
    end
    if temp3.id == (temp1.sheet_id+1)
      @sheet.discussions = temp1.discussion1+temp1.discussion2
                            +temp1.discussion3+temp1.discussion4+temp1.discussion5
                            +temp1.discussion6+temp1.discussion6+temp1.discussion7
                            +temp1.discussion8+temp1.discussion8+temp1.discusssion9
                            +temp1.discussion9+temp1.discussion10+temp1.discussion11
    else
      redirect_to :controller => 'sheets', :action => 'new'
    end
    @sheet.final = @sheet.project+@sheet.labs+@sheet.discussions+@sheet.test
    respond_to do |format|
      if @sheet.save