WorkSheet/app/controllers/show_controller.rb

  def show_talks
    @show_sheet = Sheet.find(params[:id])
---
SELECT "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", "1"]]

  def show_experiments
    @show_sheet = Sheet.find(params[:id])
    @experiment = Experiment.find(params[:id])
---
SELECT "sheets".* FROM "sheets" WHERE "sheets"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "experiments".* FROM "experiments" WHERE "experiments"."id" = ? LIMIT 1  [["id", "2"]]